app/views/shared/_use_info.html.haml

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."use_id" = ?  [["use_id", 1]]
---
%span= link_to "view my profile", current_use
%span= pluralize(current_use.microposts.count, "micropost")