app/controllers/pins_controller.rb

SELECT  "pins".* FROM "pins" WHERE (title like '%t%' or description like '%t%')  ORDER BY created_at DESC LIMIT 9 OFFSET 0
---
  def index
    @pins = Pin.paginate(page: params[:page], per_page: 9).order("created_at DESC")

INSERT INTO "pins" ("title", "description", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "image_meta", "use_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@pin = current_use.pins.build(pin_params)
		if @pin.save