app/controllers/sessions_controller.rb

SELECT  "uses".* FROM "uses" WHERE "uses"."email" = ? LIMIT 1  [["email", "example@railstutorial.org"]]
---
  def create
    use = Use.find_by(email: params[:session][:email].downcase)