app/controllers/uses_controller.rb

  def index
    @uses = Use.paginate(page: params[:page], per_page: 25).order("created_at DESC")
---
SELECT  "uses".* FROM "uses"  ORDER BY created_at DESC LIMIT 25 OFFSET 0

  def show
    @use = Use.find(params[:id])
     @microposts = current_use.microposts.build if logged_in?
    @microposts = @use.microposts.paginate(page: params[:page])
---
SELECT  "uses".* FROM "uses" WHERE "uses"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."use_id" = ?  [["use_id", 1]]

  def create
    @use = Use.new(use_params)
    if @use.save
---
INSERT INTO "uses" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @use = Use.find(params[:id])
---
SELECT  "uses".* FROM "uses" WHERE "uses"."id" = ? LIMIT 1  [["id", 1]]

    def update
    @use = Use.find(params[:id])
    if @use.update_attributes(use_params)
---
SELECT  "uses".* FROM "uses" WHERE "uses"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "uses" SET "password_digest" = ?, "updated_at" = ? WHERE "uses"."id" = ?  [["password_digest", "$2a$10$Kw1ROyI78iRqfLIpY1QdMuy0q3.YOr8L6yeOMd2RyWlGID1UPcpj."], ["updated_at", "2015-11-21 15:37:19.424890"], ["id", 1]]

    def set_use
      @use = Use.find(params[:id])
---
SELECT  "uses".* FROM "uses" WHERE "uses"."id" = ? LIMIT 1  [["id", 1]]